# настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так:

# ● A, E, I, O, U, L, N, S, T, R – 1 очко;
# ● D, G – 2 очка;
# ● B, C, M, P – 3 очка;
# ● F, H, V, W, Y – 4 очка;
# ● K – 5 очков;
# ● J, X – 8 очков;
# ● Q, Z – 10 очков.

# А русские буквы оцениваются так:
# ● А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# ● Д, К, Л, М, П, У – 2 очка;
# ● Б, Г, Ё, Ь, Я – 3 очка;
# ● Й, Ы – 4 очка;
# ● Ж, З, Х, Ц, Ч – 5 очков;
# ● Ш, Э, Ю – 8 очков;
# ● Ф, Щ, Ъ – 10 очков.

# Напишите программу, которая вычисляет стоимость
# введенного пользователем слова. Будем считать, что
# на вход подается только одно слово, которое содержит либо
#  только английские, либо только русские буквы.



# ПРИНИМАЕТ К ПОДСЧЕТУ ЛЮБЫЕ БУКВЫ (ru, eng) В ЛЮБОМ РЕГИСТРЕ!
mn1 = ["А", "В", "Е", "И", "Н", "О", "Р", "С", "Т", "а", "в", "е", "и", "н", "о", "р", "с", "т", "A", "a", "E", "e", "I", "i", "O", "o", "U", "u", "L", "l", "N", "n" "S", "s", "T", "t", "R", "r"]
mn2 = ["Д", "К", "Л", "М", "П", "У", "д", "к", "л", "м", "п", "у", "D", "d", "G", "g"]
mn3 = ["Б", "Г", "Ё", "Ь", "Я", "б", "г", "ё", "ь", "я", "B", "b", "C", "c", "M", "m", "P", "p"]
mn4 = ["Й", "Ы", "й", "ы" "F", "f", "H", "h", "V", "v", "W", "w", "Y", "y"]
mn5 = ["Ж", "З", "Х", "Ц", "Ч", "ж", "з", "х", "ц", "ч", "K", "k"]
mn6 = ["Ш", "Э", "Ю", "ш", "э", "ю", "J", "j", "X", "x"]
mn7 = ["Ф", "Щ", "Ъ", "ф", "щ", "ъ" "Q", "q", "Z", "z"]

slovo = input()  # вводим слово
# print(type(slovo))  # тип
mn_slovo = [i for i in str(slovo)]  # преобразуем слово в список
# print(mn_slovo) # смотрим как преобразовалось
d1 = 0
for i in mn_slovo:
    if i in mn1:
        d1 = d1 + 1
        # print(i)
# print(d1)

d2 = 0
for i in mn_slovo:
    if i in mn2:
        d2 = d2 + 1
        # print(i)
# print(d2)

d3 = 0
for i in mn_slovo:
    if i in mn3:
        d3 = d3 + 1
        # print(i)
# print(d3)

d4 = 0
for i in mn_slovo:
    if i in mn4:
        d4 = d4 + 1
        # print(i)
# print(d4)

d5 = 0
for i in mn_slovo:
    if i in mn5:
        d5 = d5 + 1
        # print(i)
# print(d5)

d6 = 0
for i in mn_slovo:
    if i in mn6:
        d6 = d6 + 1
        # print(i)
# print(d6)

d7 = 0
for i in mn_slovo:
    if i in mn7:
        d7 = d7 + 1
        # print(i)
# print(d7)

sum = d1 + (d2 * 2) + (d3 * 3) + (d4 * 4) + (d5 * 5) + (d6 * 8) + (d7 * 10)
print(sum)


# mn1 = ["А", "В", "Е", "И", "Н", "О", "Р", "С", "Т"]
# mn2 = ["Д", "К", "Л", "М", "П", "У"]
# mn3 = ["Б", "Г", "Ё", "Ь", "Я"]
# mn4 = ["Й", "Ы"]
# mn5 = ["Ж", "З", "Х", "Ц", "Ч"]
# mn6 = ["Ш", "Э", "Ю"]
# mn7 = ["Ф", "Щ", "Ъ"]

