# Напишите функцию same_by(characteristic, objects), которая
# проверяет, все ли объекты имеют одинаковое значение
# некоторой характеристики, и возвращают True, если это так.
# Если значение характеристики для разных объектов
# отличается - то False. Для пустого набора объектов, функция
# должна возвращать True. Аргумент characteristic - это
# функция, которая принимает объект и вычисляет его
# характеристику.

objects = input()

def characteristic(objects):
    return objects

def same_by(characteristic, objects):
   if characteristic == objects:
        return bool (characteristic == objects)
        
print(same_by)

       
