# Условие
# Даны два целых числа. Выведите значение наименьшего из них.

n = int(input())
m = int(input())
if n > m:
    print(m)
else:
    print(n)
